# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'svn' # Needed to install fonts
brew 'kubernetes-cli'



# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'redis'

# Apps
cask 'google-chrome'
cask 'phpstorm'
cask 'iterm2'
cask 'telegram-desktop'
cask 'tunnelblick'
cask 'wechat'
cask 'microsoft-edge'
cask 'maestral'
cask 'one-switch'
cask 'wechatwork'
cask 'tencent-meeting'
cask 'raycast'
cask 'dingtalk-lite'
cask 'shiftit'
cask 'notion'
cask 'enpass'
cask 'thinkorswim'
cask 'finicky'
cask 'unclack'
cask 'fig'
cask 'authy'
cask 'appcleaner'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store

mas 'Spark', id: 1176895641

