# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'kubernetes-cli'



# Development
#brew 'php'
#brew 'php@8.0'
#brew 'php@7.4'
#brew 'composer'
#brew 'mysql'
#brew 'nginx'
#brew 'redis'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-hack-nerd-font'

# Apps
cask 'iterm2'
cask 'telegram-desktop'
cask 'tunnelblick'
cask 'maestral'
cask 'wechatwork'
cask 'tencent-meeting'
cask 'dingtalk-lite'
cask 'finicky'
cask 'itsycal'
cask 'maccy'
cask 'obsidian'
cask 'shottr'
cask 'adrive'
#cask 'raycast'         # restore
#cask 'appcleaner'      # use appdelete
#cask 'google-chrome'
#cask 'devtoys'
#cask 'stats'
#cask 'one-switch'
#cask 'iina'

# Mac App Store

mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'Vimari', id: 1480933944
#mas 'Tampermonkey', id: 482490089
mas '1Password for Safari', id: 1569813296
mas 'Wechat', id: 836500024
mas 'Todoist', id: 585829637